import os
from pathlib import *
import sys
import random as r

import colors


def start(platform_clear,Hp, Atk, Mp, Coins, steps):
    os.system(platform_clear)

    print('\n                       ████████████████████████████████████████████████████'
          '\n                       █────██─█─█───█───█───█─███─███─█────█─██─█───█────█'
          '\n                       █─██─██─█─█─███─████─██─███──█──█─██─█──█─██─██─██─█'
          '\n                       █─█──██─█─█───█───██─██─███─█─█─█────█─█──██─██────█'
          '\n                       █─██─██─█─█─█████─██─██─███─███─█─██─█─██─██─██─██─█'
          '\n                       █─────█───█───█───██─██───█─███─█─██─█─██─█───█─██─█'
          '\n                       █████─██████████████████████████████████████████████')
    print('                         ▒▒▒▒▒▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▒▒▒')
    print('                         ▒▒▒▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▒')
    print('                         ▒▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▄░░▒▒▒▒▒')
    print('                         ▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░██▌░░▒▒▒▒')
    print('                         ▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░▄▄███▀░░░░▒▒▒')
    print('                         ▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░█████░▄█░░░░▒▒')
    print('                         ▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░▄████████▀░░░░▒▒')
    print('                         ▒▒░░░░░░░░░░░░░░░░░░░░░░░░▄█████████░░░░░░░▒')
    print('                         ▒░░░░░░░░░░░░░░░░░░░░░░░░░░▄███████▌░░░░░░░▒')
    print('                         ▒░░░░░░░░░░░░░░░░░░░░░░░░▄█████████░░░░░░░░▒')
    print('                         ▒░░░░░░░░░░░░░░░░░░░░░▄███████████▌░░░░░░░░▒')
    print('                         ▒░░░░░░░░░░░░░░░▄▄▄▄██████████████▌░░░░░░░░▒')
    print('                         ▒░░░░░░░░░░░▄▄███████████████████▌░░░░░░░░░▒')
    print('                         ▒░░░░░░░░░▄██████████████████████▌░░░░░░░░░▒')
    print('                         ▒░░░░░░░░████████████████████████░░░░░░░░░░▒')
    print('                         ▒█░░░░░▐██████████▌░▀▀███████████░░░░░░░░░░▒')
    print('                         ▐██░░░▄██████████▌░░░░░░░░░▀██▐█▌░░░░░░░░░▒▒')
    print('                         ▒██████░█████████░░░░░░░░░░░▐█▐█▌░░░░░░░░░▒▒')
    print('                         ▒▒▀▀▀▀░░░██████▀░░░░░░░░░░░░▐█▐█▌░░░░░░░░▒▒▒')
    print('                         ▒▒▒▒▒░░░░▐█████▌░░░░░░░░░░░░▐█▐█▌░░░░░░░▒▒▒▒')
    print('                         ▒▒▒▒▒▒░░░░███▀██░░░░░░░░░░░░░█░█▌░░░░░░▒▒▒▒▒')
    print('                         ▒▒▒▒▒▒▒▒░▐██░░░██░░░░░░░░▄▄████████▄▒▒▒▒▒▒▒▒')
    print('                         ▒▒▒▒▒▒▒▒▒██▌░░░░█▄░░░░░░▄███████████████████')
    print('                         ▒▒▒▒▒▒▒▒▒▐██▒▒░░░██▄▄███████████████████████')
    print('                         ▒▒▒▒▒▒▒▒▒▒▐██▒▒▄████████████████████████████')
    print('                         ▒▒▒▒▒▒▒▒▒▒▄▄████████████████████████████████')
    print(
        'Тебе нужно пройти через волшебный лес до Зачарованного Города для этого потребуется сделать 200 шагов, каждый бросок кубика это либо действие либо один шаг.'
        '\nНа твоем пути может встретится что угодно, монстры, бродячие торговцы, полезные предметы или могут попасться монеты по 1 единице,на них ты можешь купить жизни,броню для защиты и оружие для увеличения урона.'
        '\nЕсли вы забыли команды - введите help')
    print('\n        Приятной игры!      '
          '\n-------------------'
          '\nТы в начале пути и у тебя есть :'
          f'\n{colors.Yellow}{colors.Bold}{Coins} {colors.Reset} Монет'
          f'\n{colors.Green}{colors.Bold}{Hp} {colors.Reset}Жизни'
          f'\n{colors.Red}{colors.Bold}{Atk} {colors.Reset} Сила урона'
          f'\n{colors.Cyan}{colors.Bold}{Mp} {colors.Reset} Маны'
          '\n  -------------------')

    command = input(f'Нажми \033[5;33mEnter{colors.Reset} чтобы бросить кубик'
                    '\n')
    if command == 'save':
        save(Hp, Coins, Atk, Mp, steps)
    elif command == 'load':
        Hp, Coins, Atk, Mp, steps = load(Hp, Coins, Atk, Mp, steps)
    elif command == 'exit':
        exit_f(Hp, Coins, Atk, Mp, steps)
    elif command == 'help':
        help()

    main_game(platform_clear, Hp, Atk, Mp, Coins, steps)


def main_game(platform_clear,Hp,Atk,Mp,Coins,steps):
    while Hp > 0 and steps < 201:
        steps += 1
        os.system(platform_clear)
        situation = r.randint(0, 15)
        print('тебе выпало', situation)
        print('-------------------'
              )
        print(f'Ты прошел | {steps} | шагов'
              f'                                инвентарь: |{colors.Green}{colors.Bold}Здоровье: {Hp} {colors.Reset} |{colors.Red}{colors.Bold}Атака: {Atk} {colors.Reset} |{colors.Cyan}{colors.Bold}Мана: {Mp} {colors.Reset} |{colors.Yellow}{colors.Bold}Монеты: {Coins}{colors.Reset} |')

        if steps == 99:
            print('                       ██████████████████████████')
            print('                       █────█───█────█────█─█─█─█')
            print('                       █─██─██─██─██─█─██─█─────█')
            print('                       █─█████─██────█────██───██')
            print('                       █─██─██─██─████─██─█─────█')
            print('                       █────██─██─████─██─█─█─█─█')
            print('                       ██████████████████████████')
            print('Ты встретил стража первых врат ')
            print('у тебя есть', Coins, 'монет')
            print('и можешь купить себе:')
            print('Нажми 1 если хочешь купить щит к жизни +10Hp за 30 монет')
            print('Нажми 2 если хочешь купить эликсир к мане +20Mp за 20 монет')
            print(
                'Нажми 3 если хочешь купить молот к силе удара +40Atk за 60 монет')
            print('Нажми Enter если не хочешь ничего покупать и идти дальше')
            magz_vrat = str(input('жми '))
            print('-------------------')
            if magz_vrat == '1' and Coins < 30:
                print('страж прогнал тебя, у тебя недостаточно монет')
            elif Coins >= 30 and magz_vrat == '1':
                Coins -= 30
                Hp += 10
            if magz_vrat == '2' and Coins < 20:
                print('страж прогнал тебя, у тебя недостаточно монет')
            elif Coins >= 20:
                if magz_vrat == '2':
                    Coins -= 20
                    Mp += 20
            if magz_vrat == '3':
                if Coins < 60:
                    print('страж прогнал тебя, у тебя недостаточно монет')
            elif Coins >= 60:
                if magz_vrat == '3':
                    Coins -= 60
                    Atk += 40
            else:
                print('-------------------')
                print('Ты прошел мимо стража')
            print('У тебя в инвентаре', 'Монет-', Coins, 'Силы-', Atk, 'Здоровья-',
                  Hp, 'Маны-', Mp)

        if steps == 199:
            print('                       ██████████████████████████')
            print('                       █────█───█────█────█─█─█─█')
            print('                       █─██─██─██─██─█─██─█─────█')
            print('                       █─█████─██────█────██───██')
            print('                       █─██─██─██─████─██─█─────█')
            print('                       █────██─██─████─██─█─█─█─█')
            print('                       ██████████████████████████')
            print('Ты встретил стража вторых врат ')
            print('у тебя есть', Coins, 'монет')
            print('и можешь купить себе:')
            print('Нажми 1 если хочешь купить щит к жизни +20Hp за 60 монет')
            print('Нажми 2 если хочешь купить эликсир к мане +40Mp за 40 монет')
            print(
                'Нажми 3 если хочешь купить молот к силе удара +60Atk за 80 монет')
            print('Нажми Enter если не хочешь ничего покупать и идти дальше')
            magz_vrat_2 = input('жми ')
            print('-------------------')
            if magz_vrat_2 == '1':
                if Coins < 20:
                    print('страж прогнал тебя, у тебя недостаточно монет')
            elif Coins > 19:
                if magz_vrat_2 == '1':
                    Coins -= 60
                    Hp += 20
            if magz_vrat_2 == '2':
                if Coins < 40:
                    print('страж прогнал тебя, у тебя недостаточно монет')
            elif Coins > 39:
                if magz_vrat_2 == '2':
                    Coins -= 40
                    Mp += 40
            if magz_vrat_2 == '3':
                if Coins < 80:
                    print('страж прогнал тебя, у тебя недостаточно монет')
            elif Coins > 79:
                if magz_vrat_2 == '3':
                    Coins -= 80
                    Atk += 60
            else:
                print('-------------------')
                print('Ты прошел мимо стража')
            print('У тебя в инвентаре', 'Монет-', Coins, 'Силы-', Atk, 'Здоровья-',
                  Hp, 'Маны-', Mp)

        if steps == 200:
            Atkb_2 = r.randint(70, 160)

            print('                          █████████████████████')
            print('                          █────█────█────█────█')
            print('                          █─████─██─█─██─█─██─█')
            print('                          █────█─██─█─████─████')
            print('                          █─██─█─██─█─██─█─██─█')
            print('                          █────█────█────█────█')
            print('                          █████████████████████')
            print('                  ───────▄█──────────█─────────█▄───────')
            print('                  ─────▐██──────▄█──███──█▄─────██▌─────')
            print('                  ────▐██▀─────█████████████────▀██▌────')
            print('                  ───▐██▌─────██████████████─────▐██▌───')
            print('                  ───████────████████████████────████───')
            print('                  ──▐█████──██████████████████──█████▌──')
            print('                  ───████████████████████████████████───')
            print('                  ────███████▀▀████████████▀▀███████────')
            print('                  ─────█████▌──▄▄─▀████▀─▄▄──▐█████─────')
            print('                  ───▄▄██████▄─▀▀──████──▀▀─▄██████▄▄───')
            print('                  ──██████████████████████████████████──')
            print('                  ─████████████████████████████████████─')
            print('                  ▐██████──███████▀▄██▄▀███████──██████▌')
            print('                  ▐█████────██████████████████────█████▌')
            print('                  ▐█████─────██████▀──▀██████─────█████▌')
            print('                  ─█████▄─────███────────███─────▄█████─')
            print('                  ──██████─────█──────────█─────██████──')
            print('                  ────█████────────────────────█████────')
            print('                  ─────█████──────────────────█████─────')
            print('                  ──────█████────────────────█████──────')
            print('                  ───────████───▄────────▄───████───────')
            print('                  ────────████─██────────██─████────────')
            print('                  ────────████████─▄██▄─████████────────')
            print('                  ───────████████████████████████───────')
            print('                  ───────████████████████████████───────')
            print('                  ────────▀█████████▀▀█████████▀────────')
            print('                  ──────────▀███▀────────▀███▀──────────')

            print('На вас напал второй босс монстр! Силой', Atkb_2, 'твоя атака-',
                  Atk)
            if Atk >= Atkb_2:
                Coins += 100
                print(
                    'Ты победил первого босса монстра,охранявшего вторые врата,и ты получил 100 монет'
                )
                print('Всего у тебя', Coins, 'монет')
            elif Atk < Atkb_2:
                Hp -= 10
                print(
                    'Монстр вас покалечил,у вас отнялось 10 единиц здоровья,всего у вас',
                    Hp, 'здоровья')

        if situation == 1:
            Atkm = r.randint(0, 10)
            if steps > 80: Atkm += r.randint(0, 15)
            print('                      ███████████████████████████████')
            print('                      █─███─█────█─██─█────█───█────█')
            print('                      █──█──█─██─█─██─█─██─██─██─██─█')
            print('                      █─█─█─█─██─█────█─█████─██────█')
            print('                      █─███─█─██─█─██─█─██─██─██─████')
            print('                      █─███─█────█─██─█────██─██─████')
            print('                      ███████████████████████████████')
            print('                           ▒▒▒▒▒▒▒▒▄▄▄▄▄▄▄▄▒▒▒▒▒▒')
            print('                           ▒▒█▒▒▒▄██████████▄▒▒▒▒')
            print('                           ▒█▐▒▒▒████████████▒▒▒▒')
            print('                           ▒▌▐▒▒██▄▀██████▀▄██▒▒▒')
            print('                           ▐┼▐▒▒██▄▄▄▄██▄▄▄▄██▒▒▒')
            print('                           ▐┼▐▒▒██████████████▒▒▒')
            print('                           ▐▄▐████─▀▐▐▀█─█─▌▐██▄▒')
            print('                           ▒▒█████──────────▐███▌')
            print('                           ▒▒█▀▀██▄█─▄───▐─▄███▀▒')
            print('                           ▒▒█▒▒███████▄██████▒▒▒')
            print('                           ▒▒▒▒▒██████████████▒▒▒')
            print('                           ▒▒▒▒▒█████████▐▌██▌▒▒▒')
            print('                           ▒▒▒▒▒▐▀▐▒▌▀█▀▒▐▒█▒▒▒▒▒')
            print('                           ▒▒▒▒▒▒▒▒▒▒▒▐▒▒▒▒▌▒▒▒▒▒')
            print('На вас напал монстр! Силой', Atkm, 'твоя атака-', Atk)
            if Atk >= Atkm:
                Coins += 1
                print('Ты победил монстра,и ты получил 1 монету')
                print('Всего у тебя', Coins, 'монет')
            elif Atk < Atkm:
                Hp -= 1
                print(
                    'Монстр вас покалечил,у вас отнялась 1 единица здоровья,всего у вас',
                    Hp, 'здоровья')
        if situation == 7:
            print(
                '             ██████████████████████████████████████████████████')
            print(
                '             █─███─█───█───█────█─███─█────█─██─█────█───█────█')
            print(
                '             █──█──█─███─███─██─█──█──█─██─█─██─█─██─██─██─██─█')
            print(
                '             █─█─█─█───█─███────█─█─█─█─██─█────█─█████─██────█')
            print(
                '             █─███─█─███─███─██─█─███─█─██─█─██─█─██─██─██─████')
            print(
                '             █─███─█───█─███─██─█─███─█────█─██─█────██─██─████')
            print(
                '             ██████████████████████████████████████████████████')
            print('                           ▒▒▒▒▒▒▒▒▄▄▄▄▄▄▄▄▒▒▒▒▒▒')
            print('                           ▒▒█▒▒▒▄██████████▄▒▒▒▒')
            print('                           ▒█▐▒▒▒████████████▒▒▒▒')
            print('                           ▒▌▐▒▒██▄▀██████▀▄██▒▒▒')
            print('                           ▐┼▐▒▒██▄▄▄▄██▄▄▄▄██▒▒▒')
            print('                           ▐┼▐▒▒██████████████▒▒▒')
            print('                           ▐▄▐████─▀▐▐▀█─█─▌▐██▄▒')
            print('                           ▒▒█████──────────▐███▌')
            print('                           ▒▒█▀▀██▄█─▄───▐─▄███▀▒')
            print('                           ▒▒█▒▒███████▄██████▒▒▒')
            print('                           ▒▒▒▒▒██████████████▒▒▒')
            print('                           ▒▒▒▒▒█████████▐▌██▌▒▒▒')
            print('                           ▒▒▒▒▒▐▀▐▒▌▀█▀▒▐▒█▒▒▒▒▒')
            print('                           ▒▒▒▒▒▒▒▒▒▒▒▐▒▒▒▒▌▒▒▒▒▒')
            Atkm = r.randint(5, 15)
            if steps > 80: Atkm += r.randint(10, 20)
            print('На вас напал МегаМонстр!Силой', Atkm, 'твоя атака-', Atk)
            if Atk >= Atkm:
                Coins += 3
                print('Ты победил монстра,и ты получил 3 монеты')
                print('Всего у тебя', Coins, 'монет')
            if Atk < Atkm:
                Hp -= 1
                print(
                    'Монстр вас покалечил,у вас отнялась 1 единица здоровья,всего у вас',
                    Hp, 'здоровья')

        elif situation == 2:
            print(f'{colors.Yellow}Вы нашли 1 золотую монету{colors.Reset}')
            Coins += 1
            print('Всего у тебя', Coins, 'монет')

        elif situation == 3:
            print(f'{colors.Cyan}Вы нашли малый бутылёчек с маной(+1 к Мане){colors.Reset}')
            Mp += 1
            print('Всего у тебя', Mp, 'маны')

        elif situation == 4:
            print(f'{colors.Green}Вы нашли бинт с зелёнкой(+1 к Здоровью){colors.Reset}')
            Hp += 1
            print('Всего у тебя', Hp, 'здоровья')

        elif situation == 5:
            print(f'{colors.Red}Вы нашли оружие, чуть лучше вашего(+1 к Атаке){colors.Reset} ')
            Atk += 1
            print('Всего у тебя', Atk, 'силы урона')

        elif situation == 0:
            print('-------------------')
            print(f'{colors.Blinking}Ты встретил бродячего торговца{colors.Reset}')
            print('И можешь купить себе:')
            print('Нажми 1 если хочешь купить ауру к жизни +2Hp за 2 монет')
            print('Нажми 2 если хочешь купить амулет к мане +1Mp за 1 монету')
            print('Нажми 3 если хочешь купить нунчаки к силе удара +5Atk за 3 монеты')
            print('Нажми Enter если не хочешь ничего покупать и идти дальше')
            magaz = input('жми ')
            print('-------------------')
            if magaz == '1':
                if Coins < 2:
                    print('Торговец плюнул тебе в лицо, у тебя недостаточно монет')
                elif Coins >= 2:
                    Coins -= 2
                    Hp += 2
            elif magaz == '2':
                if Coins < 1:
                    print('Торговец плюнул тебе в лицо, у тебя недостаточно монет')
                elif Coins >= 1:
                    Coins -= 1
                    Mp += 1
            elif magaz == '3':
                if Coins < 3:
                    print('Торговец плюнул тебе в лицо, у тебя недостаточно монет')
                elif Coins >= 3:
                    Coins -= 3
                    Atk += 5
            else:
                print('Ты прошел мимо торговца')

            print('У тебя в инвентаре', 'Монет-', Coins, 'Силы-', Atk, 'Здоровья-', Hp, 'Маны-', Mp)
        elif situation == 6:
            loter_1 = r.randint(1, 10)
            print('-------------------')
            print('           ██████████████████████████████')
            print('           █─███─█─█─█───█─██─█─██─█─██─█')
            print('           █─███─█─█─██─██─██─█─██─█─█─██')
            print('           █─█─█─█───██─██────█─█──█──███')
            print('           █─█─█─███─██─██─██─█──█─█─█─██')
            print('           █─────█───██─██─██─█─██─█─██─█')
            print('           ██████████████████████████████')
            print('       ░░░░░░░░░░░░░░░░░░░▄░▄░░░░░░░░░░░░░░░')
            print('       ░░░░░░░░░░░░░░░▄█▄█████▄█░░░░░░░░░░░░')
            print('       ░░░░░░░░░░░░░░▄█████████▀░░░░░░░░░░░░')
            print('       ░░░░░░░░░░░░▄█▀▀▀▀▀▀▀▀▀█▄▄░░░░░░░░░░░')
            print('       ░░░░░░░░░▄█▀▀░░░░░░░░░░░░▀█▄░░░░░░░░░')
            print('       ░░░░░▄▄▄▄█░░░░░░░▄▄▄▄░░░░░░▀█▄▄▄░░░░░')
            print('       ░░░▄▄████░░░░░░░▄▄▄▄▄▄░░░░░░▀████▄░░░')
            print('       ░░▀█████░░░░░░░░░░░░░░░░░░░░░█████▀░░')
            print('       ░███████░░░░░░░░░░░░░░░░░░░░░░██████▄')
            print('       █████▀██░░░░▄█░░░░░░░░░▄█▄░░░░█▀█████')
            print('       █████░██░▄██▀▀██▄░░░▄██▀▀██▄░░█░█████')
            print('       ▀████░██░▀██████▀░░░░▀█████▀░░█░█████')
            print('       ░███████░░░░█▀░░░▄▄▄░░░░▀█░░░▄█▄████▀')
            print('       ░▀██████▄░░░░░░░█████▄░░░░░░░███████░')
            print('       ░░▀░█▀░▀█░░░░░░░██████░░░░░░██░▀█░░▀░')
            print('       ░░░░░░░░▀█░░▄▄░░░▀▀▀▀░░▄▄░░▄█░░░░░░░░')
            print('       ░░░░░░░░░▀█░▀█▄██▄░▄▄█▄█▀░▄█░░░░░░░░░')
            print('       ░░░░░░░░░░▀█▄░▀████████▀▄█▀░░░░░░░░░░')
            print('       ░░░░░░░░░░░░▀█▄░▀░▀░▀░▄█▀░░░░░░░░░░░░')
            print('       ░░░░░░░░░░░░░░▀▀▄▄▄▄▄▀▀░░░░░░░░░░░░░░')
            print(f'{colors.Purple}{colors.Blinking}Ты встретил гнома-шутника который любит сыграть на удачу{colors.Reset}')
            print('И можешь попробовать за 10 монет')
            print('Угадать число загаданное и получить 30 монет ')
            print('Нажми "Y" если хочешь угадать число ')
            print('Нажми любую клавишу если хочешь пройти мимо')
            otvet = input()
            if otvet.lower() == 'y':

                if Coins < 10:
                    print('Гном над тобой посмеялся, у тебя недостаточно монет')
                elif Coins >= 10:
                    otvet = int(input('Напиши число на удачу от 1 до 10  '))
                    if otvet == loter_1:
                        print('-------------------')
                        print('СЧАСТЛИВЧИК, получи 50 монет')
                        Coins += 40
                    elif otvet != otvet:
                        print('Гном над тобой посмеялся,тебе не повезло ты потратил 10 монет')
                        Coins -= 10
            else:
                print('-------------------')
                print('Ты был хитрее и прошел мимо гнома')
            print('У тебя в инвентаре', 'Монет-', Coins)
        elif situation == 8:
            print('-------------------')
            print(f'{colors.Cyan}{colors.Blinking}Ты встретил заброшенный алтарь{colors.Reset}')
            print('И можешь попросить священника дать тебе:')
            print('Нажми 1 если хочешь взять телепорт +50 шагов за 20 маны')
            print('Нажми 2 если хочешь взять посох + 10Atk за 25 маны')
            print('Нажми 3 если хочешь взять камень жизни +15 Hp за 30 маны')
            print('Нажми Enter если не хочешь ничего покупать и идти дальше')
            altar = input('жми ')
            print('-------------------')
            if altar == '1':
                if Mp < 20:
                    print(
                        'священник дал тебе своим посохом по лбу, за его потраченное время, у тебя недостаточно маны'
                    )
                elif Mp > 19:
                    Mp -= 20
                    steps += 50
            if altar == '2':
                if Mp < 25:
                    print(
                        'священник дал тебе своим посохом по лбу, за его потраченное время, у тебя недостаточно монет'
                    )
                elif Mp >=25:
                    Mp -= 25
                    Atk += 10
            if altar == '3':
                if Mp < 30:
                    print(
                        'священник дал тебе своим посохом по лбу, за его потраченное время, у тебя недостаточно монет'
                    )
                elif Mp >=30:
                    Mp -= 30
                    Hp += 15
                else:
                    print('Ты прошел мимо алтаря')
            print('У тебя в инвентаре', 'Силы-', Atk, 'Здоровья-', Hp, 'Маны-', Mp)
        else:
            print('Бегу...')
        if steps == 100:
            print('                          █████████████████████')
            print('                          █────█────█────█────█')
            print('                          █─████─██─█─██─█─██─█')
            print('                          █────█─██─█─████─████')
            print('                          █─██─█─██─█─██─█─██─█')
            print('                          █────█────█────█────█')
            print('                          █████████████████████')
            print('                  ───────▄█──────────█─────────█▄───────')
            print('                  ─────▐██──────▄█──███──█▄─────██▌─────')
            print('                  ────▐██▀─────█████████████────▀██▌────')
            print('                  ───▐██▌─────██████████████─────▐██▌───')
            print('                  ───████────████████████████────████───')
            print('                  ──▐█████──██████████████████──█████▌──')
            print('                  ───████████████████████████████████───')
            print('                  ────███████▀▀████████████▀▀███████────')
            print('                  ─────█████▌──▄▄─▀████▀─▄▄──▐█████─────')
            print('                  ───▄▄██████▄─▀▀──████──▀▀─▄██████▄▄───')
            print('                  ──██████████████████████████████████──')
            print('                  ─████████████████████████████████████─')
            print('                  ▐██████──███████▀▄██▄▀███████──██████▌')
            print('                  ▐█████────██████████████████────█████▌')
            print('                  ▐█████─────██████▀──▀██████─────█████▌')
            print('                  ─█████▄─────███────────███─────▄█████─')
            print('                  ──██████─────█──────────█─────██████──')
            print('                  ────█████────────────────────█████────')
            print('                  ─────█████──────────────────█████─────')
            print('                  ──────█████────────────────█████──────')
            print('                  ───────████───▄────────▄───████───────')
            print('                  ────────████─██────────██─████────────')
            print('                  ────────████████─▄██▄─████████────────')
            print('                  ───────████████████████████████───────')
            print('                  ───────████████████████████████───────')
            print('                  ────────▀█████████▀▀█████████▀────────')
            print('                  ──────────▀███▀────────▀███▀──────────')
            Atkb = r.randint(30, 100)
            print('На вас напал первый босс монстр! Силой', Atkb, 'твоя атака-',
                  Atk)
            if Atk >= Atkb:
                Coins += 1
                print(
                    'Ты победил второй босса монстра,охранявшего последние врата,и ты получил 50 монет'
                )
                print('Всего у тебя', Coins, 'монет')
            elif Atk < Atkb:
                Hp -= 5
                print(
                    'Монстр вас покалечил,у вас отнялось 5 единиц здоровья,всего у вас',
                    Hp, 'здоровья')
        command = str(input('жми Enter'
                            '\n'))
        if command == 'save':
            save(Hp, Coins, Atk, Mp, steps)
        elif command == 'load':
            Hp, Coins, Atk, Mp, steps = load(Hp, Coins, Atk, Mp, steps)
        elif command == 'exit':
            exit_f(Hp, Coins, Atk, Mp, steps)
        elif command == 'help':
            help()
        os.system(platform_clear)
    if Hp <= 0:
        print('▒▒▒▒▒▒▒▒▒▒▒▄▄▄▄░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('▒▒▒▒▒▒▒▒▒▄██████▒▒▒▒▒▄▄▄█▄▒▒▒▒▒▒▒▒▒▒')
        print('▒▒▒▒▒▒▒▄██▀░░▀██▄▒▒▒▒████████▄▒▒▒▒▒▒')
        print('▒▒▒▒▒▒███░░░░░░██▒▒▒▒▒▒█▀▀▀▀▀██▄▄▒▒▒')
        print('▒▒▒▒▒▄██▌░░░░░░░██▒▒▒▒▐▌▒▒▒▒▒▒▒▒▀█▄▒')
        print('▒▒▒▒▒███░░▐█░█▌░██▒▒▒▒█▌▒▒▒▒▒▒▒▒▒▒▀▌')
        print('▒▒▒▒████░▐█▌░▐█▌██▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('▒▒▒▐████░▐░░░░░▌██▒▒▒█▌▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('▒▒▒▒████░░░▄█░░░██▒▒▐█▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('▒▒▒▒████░░░██░░██▌▒▒█▌▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('▒▒▒▒████▌░▐█░░███▒▒▒█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('▒▒▒▒▐████░░▌░███▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('▒▒▒▒▒████░░░███▒▒▒▒█▌▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('▒▒▒██████▌░████▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('▒▐████████████▒▒███▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('▒█████████████▄████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('██████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('██████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('█████████████████▀▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('█████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
        print('Ты погиб')
        input()
        restart(platform_clear,Hp, Atk, Mp, Coins, steps)

    elif steps == 201:
        print('!!!!!!!!!!!!!!!!Ты победил!!!!!!!!!!!!!!!!!!')
        print('!!!!!ты дошел до до Зачарованного Города!!!!!!')
        print('!!!!!!!!!!!!!!!!Ты победил!!!!!!!!!!!!!!!!!!')
        print('-------------------')
        print('У тебя в инвентаре', 'Монет-', Coins, 'Силы-', Atk, 'Здоровья-', Hp,
              'Маны-', Mp)
        input()

def choose_platform(pl):
    platform = input('\nНа какой платформе ты играешь?'
                     '\nLinux - L'
                     '\nWindows - W'
                     '\n')

    platform = platform.lower()

    if platform == 'l' :
        pl = 'clear'
    elif platform == 'w':
        pl = 'cls'
    else:
        print('\n Плафторма была указана некорректно, назначена платформа по умолчанию(Windows)')
        pl = 'cls'
        input()
    os.system(pl)
    return pl

def type_cheats(cheats,hp,coins,atk,mp,steps):
    if cheats == '2208':
        hp += 9999
        print('Ты активировал чит на здоровье')
        input()
    elif cheats == '2008':
        coins += 9999
        print('Ты активировал чит на монеты')
        input()
    elif cheats == '0901':
        atk += 9999
        print('Ты активировал чит на атаку')
        input()
    elif cheats == '1707':
        mp += 9999
        print('Ты активировал чит на ману')
        input()
    elif cheats == '2828':
        steps += 200
        print('Ты активировал чит на шаги')
        input()

    elif cheats == '2106':
        hp += 9999
        coins += 9999
        atk += 9999
        mp += 9999
        steps += 200
        print('Ты активировал универсальный чит')

    return hp,coins,atk,mp,steps

def save(hp,coins,atk,mp,steps):
    name = str(input('\nВведите название для сохранения без ".txt"'
                     '\nили нажмите Enter для сохранения файла с названием по умолчанию'
                     '\n*название по умлочанию - sv'
                     '\n!ПРИ СОХРАНЕНИИ ФАЙЛА С НАЗВАНИЕМ ПО УМОЛЧАНИЮ СТАРОЕ СОХРАНЕНИЕ С ТАКИМ ИМЕНЕМ ПЕРЕЗАПИСЫВАЕТСЯ'
                     '\n'))

    if name == '':
        name = 'sv'

    save_folder = 'save'
    os.makedirs(save_folder, exist_ok=True)
    file_path = os.path.join(save_folder, name + '.txt')
    with open(file_path,'w') as f:
        f.write(f'{str(hp)}')
        f.write(f'\n{str(atk)}')
        f.write(f'\n{str(mp)}')
        f.write(f'\n{str(coins)}')
        f.write(f'\n{str(steps)}')

    print('Сохранено!')
    input('Продолжить-> ')


def load(hp,atk,mp,coins,steps):

    folder = Path('save')
    count = 0
    saves = []
    for file in folder.glob('*.txt'):
        saves.append(file.name)
        count +=1
    print(f'\nДоступно {count} сохранений')
    for i,save in enumerate(saves,start=1):
        save_file = open(f'{folder}/{save}','r').readlines()
        hp_f,atk_f,mp_f,coins_f,steps_f = map(int,save_file)
        print(f'{i}) {save}: {hp_f} Здоровья, {atk_f} Атаки, {mp_f} Маны, {coins_f} Монет, {steps_f} Шагов')

    choose_load = (input('\nВыберите сохранение написав соответствующий ему номер:'
                            '\n'))

    if str(choose_load) == '':
        return hp,atk,mp,coins,steps
    f = open(f'{folder}/{saves[int(choose_load)-1]}','r').readlines()
    hp,atk,mp,coins,steps = map(int,f)

    return hp,atk,mp,coins,steps

def exit_f(hp,coins,atk,mp,steps):

    exit_inp = str(input(f"\nХотите сохраниться?  {colors.Yellow}[Y/n]{colors.Reset}"))
    exit_inp = exit_inp.lower()

    if exit_inp == 'y' or '':
        save(hp,coins,atk,mp,steps)
        sys.exit()
    else:
        sys.exit()
def restart(platform_clear):
    restart_inp = str(input(f'\nХотите сыграть заново? {colors.Yellow}[Y/n]{colors.Reset}'))
    restart_inp = restart_inp.lower()
    if restart_inp == 'y' or '':
        steps = 0
        Coins = 1
        Hp = 3
        Atk = 2
        Mp = 10
        start(platform_clear,Hp, Atk, Mp, Coins, steps)

def help():
    print('\nВсе комманды :'
          '\nsave - сохраняет ваш прогресс'
          '\nload - загружает игру из существующих сохранений'
          '\nexit - предлагает сохранить прогресс и выходит из игры'
          '\nhelp - выводит список команд')
    input('\nПродолжить->')
