import random as r
import os

import funcs
from funcs import restart

steps = 0
Coins = 1
Hp = 3
Atk = 2
Mp = 10

platform_clear = '';platform_clear = funcs.choose_platform(platform_clear)
cheats = input('\n                   Добро пожаловать в RPG игру,Нажми ENTER,чтобы продолжить\n')

Hp,Coins,Atk,Mp,steps = funcs.type_cheats(cheats,Hp,Coins,Atk,Mp,steps)





os.system(platform_clear)

print('\n                       ████████████████████████████████████████████████████'
      '\n                       █────██─█─█───█───█───█─███─███─█────█─██─█───█────█'
      '\n                       █─██─██─█─█─███─████─██─███──█──█─██─█──█─██─██─██─█'
      '\n                       █─█──██─█─█───█───██─██─███─█─█─█────█─█──██─██────█'
      '\n                       █─██─██─█─█─█████─██─██─███─███─█─██─█─██─██─██─██─█'
      '\n                       █─────█───█───█───██─██───█─███─█─██─█─██─█───█─██─█'
      '\n                       █████─██████████████████████████████████████████████')
print('                         ▒▒▒▒▒▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▒▒▒')
print('                         ▒▒▒▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▒')
print('                         ▒▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▄░░▒▒▒▒▒')
print('                         ▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░██▌░░▒▒▒▒')
print('                         ▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░▄▄███▀░░░░▒▒▒')
print('                         ▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░█████░▄█░░░░▒▒')
print('                         ▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░▄████████▀░░░░▒▒')
print('                         ▒▒░░░░░░░░░░░░░░░░░░░░░░░░▄█████████░░░░░░░▒')
print('                         ▒░░░░░░░░░░░░░░░░░░░░░░░░░░▄███████▌░░░░░░░▒')
print('                         ▒░░░░░░░░░░░░░░░░░░░░░░░░▄█████████░░░░░░░░▒')
print('                         ▒░░░░░░░░░░░░░░░░░░░░░▄███████████▌░░░░░░░░▒')
print('                         ▒░░░░░░░░░░░░░░░▄▄▄▄██████████████▌░░░░░░░░▒')
print('                         ▒░░░░░░░░░░░▄▄███████████████████▌░░░░░░░░░▒')
print('                         ▒░░░░░░░░░▄██████████████████████▌░░░░░░░░░▒')
print('                         ▒░░░░░░░░████████████████████████░░░░░░░░░░▒')
print('                         ▒█░░░░░▐██████████▌░▀▀███████████░░░░░░░░░░▒')
print('                         ▐██░░░▄██████████▌░░░░░░░░░▀██▐█▌░░░░░░░░░▒▒')
print('                         ▒██████░█████████░░░░░░░░░░░▐█▐█▌░░░░░░░░░▒▒')
print('                         ▒▒▀▀▀▀░░░██████▀░░░░░░░░░░░░▐█▐█▌░░░░░░░░▒▒▒')
print('                         ▒▒▒▒▒░░░░▐█████▌░░░░░░░░░░░░▐█▐█▌░░░░░░░▒▒▒▒')
print('                         ▒▒▒▒▒▒░░░░███▀██░░░░░░░░░░░░░█░█▌░░░░░░▒▒▒▒▒')
print('                         ▒▒▒▒▒▒▒▒░▐██░░░██░░░░░░░░▄▄████████▄▒▒▒▒▒▒▒▒')
print('                         ▒▒▒▒▒▒▒▒▒██▌░░░░█▄░░░░░░▄███████████████████')
print('                         ▒▒▒▒▒▒▒▒▒▐██▒▒░░░██▄▄███████████████████████')
print('                         ▒▒▒▒▒▒▒▒▒▒▐██▒▒▄████████████████████████████')
print('                         ▒▒▒▒▒▒▒▒▒▒▄▄████████████████████████████████')
print('Тебе нужно пройти через волшебный лес до Зачарованного Города для этого потребуется сделать 200 шагов, каждый бросок кубика это либо действие либо один шаг.'
      '\nНа твоем пути может встретится что угодно, монстры, бродячие торговцы, полезные предметы или могут попасться монеты по 1 единице,на них ты можешь купить жизни,броню для защиты и оружие для увеличения урона.'
      '\nЕсли вы забыли команды - введите help')
print('\n        Приятной игры!      '
      '\n-------------------'
      '\nТы в начале пути и у тебя есть :'
      f'\n\033[1;33m{Coins}\033[0m Монет'
      f'\n\033[1;32m{Hp} \033[0m Жизни'
      f'\n\033[1;31m{Atk} \033[0m Сила урона'
      f'\n\033[1;36m{Mp} \033[0m Маны'
      '\n  -------------------')

command = input('Нажми \033[5;33mEnter\033[0m чтобы бросить кубик'
                '\n')
if command == 'save':
    funcs.save(Hp, Coins, Atk, Mp, steps)
elif command == 'load':
    Hp, Coins, Atk, Mp, steps = funcs.load(Hp, Coins, Atk, Mp, steps)
elif command == 'exit':
    funcs.exit_f(Hp,Coins,Atk,Mp,steps)
elif command == 'help':
    funcs.help()

funcs.main_game(platform_clear,Hp, Atk, Mp, Coins, steps)
