import random as r
import os

import funcs

steps = 0
Coins = 1
Hp = 3
Atk = 2
Mp = 10
platform_clear = ''
platform_clear = funcs.choose_platform(platform_clear)
cheats = input(
    '\n                   Добро пожаловать в RPG игру,Нажми ENTER,чтобы продолжить\n'
)

Hp,Coins,Atk,Mp,steps = funcs.type_cheats(cheats,Hp,Coins,Atk,Mp,steps)





os.system(platform_clear)
print(
    '                     ████████████████████████████████████████████████████'
)
print(
    '                     █────██─█─█───█───█───█─███─███─█────█─██─█───█────█'
)
print(
    '                     █─██─██─█─█─███─████─██─███──█──█─██─█──█─██─██─██─█'
)
print(
    '                     █─█──██─█─█───█───██─██─███─█─█─█────█─█──██─██────█'
)
print(
    '                     █─██─██─█─█─█████─██─██─███─███─█─██─█─██─██─██─██─█'
)
print(
    '                     █─────█───█───█───██─██───█─███─█─██─█─██─█───█─██─█'
)
print(
    '                     █████─██████████████████████████████████████████████'
)
print('                         ▒▒▒▒▒▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▒▒▒')
print('                         ▒▒▒▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▒')
print('                         ▒▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░▄░░▒▒▒▒▒')
print('                         ▒▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░██▌░░▒▒▒▒')
print('                         ▒▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░▄▄███▀░░░░▒▒▒')
print('                         ▒▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░░█████░▄█░░░░▒▒')
print('                         ▒▒░░░░░░░░░░░░░░░░░░░░░░░░░░▄████████▀░░░░▒▒')
print('                         ▒▒░░░░░░░░░░░░░░░░░░░░░░░░▄█████████░░░░░░░▒')
print('                         ▒░░░░░░░░░░░░░░░░░░░░░░░░░░▄███████▌░░░░░░░▒')
print('                         ▒░░░░░░░░░░░░░░░░░░░░░░░░▄█████████░░░░░░░░▒')
print('                         ▒░░░░░░░░░░░░░░░░░░░░░▄███████████▌░░░░░░░░▒')
print('                         ▒░░░░░░░░░░░░░░░▄▄▄▄██████████████▌░░░░░░░░▒')
print('                         ▒░░░░░░░░░░░▄▄███████████████████▌░░░░░░░░░▒')
print('                         ▒░░░░░░░░░▄██████████████████████▌░░░░░░░░░▒')
print('                         ▒░░░░░░░░████████████████████████░░░░░░░░░░▒')
print('                         ▒█░░░░░▐██████████▌░▀▀███████████░░░░░░░░░░▒')
print('                         ▐██░░░▄██████████▌░░░░░░░░░▀██▐█▌░░░░░░░░░▒▒')
print('                         ▒██████░█████████░░░░░░░░░░░▐█▐█▌░░░░░░░░░▒▒')
print('                         ▒▒▀▀▀▀░░░██████▀░░░░░░░░░░░░▐█▐█▌░░░░░░░░▒▒▒')
print('                         ▒▒▒▒▒░░░░▐█████▌░░░░░░░░░░░░▐█▐█▌░░░░░░░▒▒▒▒')
print('                         ▒▒▒▒▒▒░░░░███▀██░░░░░░░░░░░░░█░█▌░░░░░░▒▒▒▒▒')
print('                         ▒▒▒▒▒▒▒▒░▐██░░░██░░░░░░░░▄▄████████▄▒▒▒▒▒▒▒▒')
print('                         ▒▒▒▒▒▒▒▒▒██▌░░░░█▄░░░░░░▄███████████████████')
print('                         ▒▒▒▒▒▒▒▒▒▐██▒▒░░░██▄▄███████████████████████')
print('                         ▒▒▒▒▒▒▒▒▒▒▐██▒▒▄████████████████████████████')
print('                         ▒▒▒▒▒▒▒▒▒▒▄▄████████████████████████████████')
print(
    'Тебе нужно пройти через волшебный лес до Зачарованного Города для этого потребуется сделать 200 шагов, каждый бросок кубика это либо действие либо один шаг'
)
print(
    'На твоем пути может встретится что угодно, монстры, бродячие торговцы, полезные предметы или могут попасться монеты по 1 единице,на них ты можешь купить жизни,броню для защиты и оружие для увеличения урона'
)
print('        Приятной игры!      ')
print('-------------------')
print('Ты в начале пути и у тебя есть :')
print(Coins, 'Монет')
print(Hp, 'Жизни')
print(Atk, 'Сила урона')
print('-------------------')
command = input('нажми Enter чтобы бросить кубик'
                '\n')
if command == 'save':
    funcs.save(Hp, Coins, Atk, Mp, steps)
elif command == 'load':
    Hp, Coins, Atk, Mp, steps = funcs.load(Hp, Coins, Atk, Mp, steps)

while Hp > 0 and steps < 201:
    steps += 1
    os.system(platform_clear)
    print('-------------------')
    print('Ты прошел|', steps,
          '|шагов                          инвентарь: |Здоровье:', Hp,
          '|Атака:', Atk, '|Мана:', Mp, '|Монеты:', Coins, '|')

    situation = r.randint(0, 15)
    print('тебе выпало', situation)

    if steps == 99:
        print('                       ██████████████████████████')
        print('                       █────█───█────█────█─█─█─█')
        print('                       █─██─██─██─██─█─██─█─────█')
        print('                       █─█████─██────█────██───██')
        print('                       █─██─██─██─████─██─█─────█')
        print('                       █────██─██─████─██─█─█─█─█')
        print('                       ██████████████████████████')
        print('Ты встретил стража первых врат ')
        print('у тебя есть', Coins, 'монет')
        print('и можешь купить себе:')
        print('Нажми 1 если хочешь купить щит к жизни +10Hp за 30 монет')
        print('Нажми 2 если хочешь купить эликсир к мане +20Mp за 20 монет')
        print(
            'Нажми 3 если хочешь купить молот к силе удара +40Atk за 60 монет')
        print('Нажми Enter если не хочешь ничего покупать и идти дальше')
        magz_vrat = str(input('жми '))
        print('-------------------')
        if magz_vrat == '1' and Coins < 30:
              print('страж прогнал тебя, у тебя недостаточно монет')
        elif Coins >= 30 and  magz_vrat == '1':
              Coins -= 30
              Hp += 10
        if magz_vrat == '2' and Coins < 20:
              print('страж прогнал тебя, у тебя недостаточно монет')
        elif Coins >= 20:
            if magz_vrat == '2':
                Coins -= 20
                Mp += 20
        if magz_vrat == '3':
            if Coins < 60:
                print('страж прогнал тебя, у тебя недостаточно монет')
        elif Coins >= 60:
            if magz_vrat == '3':
                Coins -= 60
                Atk += 40
        else:
            print('-------------------')
            print('Ты прошел мимо стража')
        print('У тебя в инвентаре', 'Монет-', Coins, 'Силы-', Atk, 'Здоровья-',
              Hp, 'Маны-', Mp)
    if steps == 199:
        print('                       ██████████████████████████')
        print('                       █────█───█────█────█─█─█─█')
        print('                       █─██─██─██─██─█─██─█─────█')
        print('                       █─█████─██────█────██───██')
        print('                       █─██─██─██─████─██─█─────█')
        print('                       █────██─██─████─██─█─█─█─█')
        print('                       ██████████████████████████')
        print('Ты встретил стража вторых врат ')
        print('у тебя есть', Coins, 'монет')
        print('и можешь купить себе:')
        print('Нажми 1 если хочешь купить щит к жизни +20Hp за 60 монет')
        print('Нажми 2 если хочешь купить эликсир к мане +40Mp за 40 монет')
        print(
            'Нажми 3 если хочешь купить молот к силе удара +60Atk за 80 монет')
        print('Нажми Enter если не хочешь ничего покупать и идти дальше')
        magz_vrat_2 = input('жми ')
        print('-------------------')
        if magz_vrat_2 == '1':
            if Coins < 20:
                print('страж прогнал тебя, у тебя недостаточно монет')
        elif Coins > 19:
            if magz_vrat_2 == '1':
                Coins -= 60
                Hp += 20
        if magz_vrat_2 == '2':
            if Coins < 40:
                print('страж прогнал тебя, у тебя недостаточно монет')
        elif Coins > 39:
            if magz_vrat_2 == '2':
                Coins -= 40
                Mp += 40
        if magz_vrat_2 == '3':
            if Coins < 80:
                print('страж прогнал тебя, у тебя недостаточно монет')
        elif Coins > 79:
            if magz_vrat_2 == '3':
                Coins -= 80
                Atk += 60
        else:
            print('-------------------')
            print('Ты прошел мимо стража')
        print('У тебя в инвентаре', 'Монет-', Coins, 'Силы-', Atk, 'Здоровья-',
              Hp, 'Маны-', Mp)

    if steps == 200:
        Atkb_2 = r.randint(70, 160)

        print('                          █████████████████████')
        print('                          █────█────█────█────█')
        print('                          █─████─██─█─██─█─██─█')
        print('                          █────█─██─█─████─████')
        print('                          █─██─█─██─█─██─█─██─█')
        print('                          █────█────█────█────█')
        print('                          █████████████████████')
        print('                  ───────▄█──────────█─────────█▄───────')
        print('                  ─────▐██──────▄█──███──█▄─────██▌─────')
        print('                  ────▐██▀─────█████████████────▀██▌────')
        print('                  ───▐██▌─────██████████████─────▐██▌───')
        print('                  ───████────████████████████────████───')
        print('                  ──▐█████──██████████████████──█████▌──')
        print('                  ───████████████████████████████████───')
        print('                  ────███████▀▀████████████▀▀███████────')
        print('                  ─────█████▌──▄▄─▀████▀─▄▄──▐█████─────')
        print('                  ───▄▄██████▄─▀▀──████──▀▀─▄██████▄▄───')
        print('                  ──██████████████████████████████████──')
        print('                  ─████████████████████████████████████─')
        print('                  ▐██████──███████▀▄██▄▀███████──██████▌')
        print('                  ▐█████────██████████████████────█████▌')
        print('                  ▐█████─────██████▀──▀██████─────█████▌')
        print('                  ─█████▄─────███────────███─────▄█████─')
        print('                  ──██████─────█──────────█─────██████──')
        print('                  ────█████────────────────────█████────')
        print('                  ─────█████──────────────────█████─────')
        print('                  ──────█████────────────────█████──────')
        print('                  ───────████───▄────────▄───████───────')
        print('                  ────────████─██────────██─████────────')
        print('                  ────────████████─▄██▄─████████────────')
        print('                  ───────████████████████████████───────')
        print('                  ───────████████████████████████───────')
        print('                  ────────▀█████████▀▀█████████▀────────')
        print('                  ──────────▀███▀────────▀███▀──────────')

        print('На вас напал второй босс монстр! Силой', Atkb_2, 'твоя атака-',
              Atk)
        if Atk >= Atkb_2:
            Coins += 100
            print(
                'Ты победил первого босса монстра,охранявшего вторые врата,и ты получил 100 монет'
            )
            print('Всего у тебя', Coins, 'монет')
        elif Atk < Atkb_2:
            Hp -= 10
            print(
                'Монстр вас покалечил,у вас отнялось 10 единиц здоровья,всего у вас',
                Hp, 'здоровья')

    if situation == 1:
        Atkm = r.randint(0, 10)
        if steps > 80: Atkm += r.randint(0, 15)
        print('                      ███████████████████████████████')
        print('                      █─███─█────█─██─█────█───█────█')
        print('                      █──█──█─██─█─██─█─██─██─██─██─█')
        print('                      █─█─█─█─██─█────█─█████─██────█')
        print('                      █─███─█─██─█─██─█─██─██─██─████')
        print('                      █─███─█────█─██─█────██─██─████')
        print('                      ███████████████████████████████')
        print('                           ▒▒▒▒▒▒▒▒▄▄▄▄▄▄▄▄▒▒▒▒▒▒')
        print('                           ▒▒█▒▒▒▄██████████▄▒▒▒▒')
        print('                           ▒█▐▒▒▒████████████▒▒▒▒')
        print('                           ▒▌▐▒▒██▄▀██████▀▄██▒▒▒')
        print('                           ▐┼▐▒▒██▄▄▄▄██▄▄▄▄██▒▒▒')
        print('                           ▐┼▐▒▒██████████████▒▒▒')
        print('                           ▐▄▐████─▀▐▐▀█─█─▌▐██▄▒')
        print('                           ▒▒█████──────────▐███▌')
        print('                           ▒▒█▀▀██▄█─▄───▐─▄███▀▒')
        print('                           ▒▒█▒▒███████▄██████▒▒▒')
        print('                           ▒▒▒▒▒██████████████▒▒▒')
        print('                           ▒▒▒▒▒█████████▐▌██▌▒▒▒')
        print('                           ▒▒▒▒▒▐▀▐▒▌▀█▀▒▐▒█▒▒▒▒▒')
        print('                           ▒▒▒▒▒▒▒▒▒▒▒▐▒▒▒▒▌▒▒▒▒▒')
        print('На вас напал монстр! Силой', Atkm, 'твоя атака-', Atk)
        if Atk >= Atkm:
            Coins += 1
            print('Ты победил монстра,и ты получил 1 монету')
            print('Всего у тебя', Coins, 'монет')
        elif Atk < Atkm:
            Hp -= 1
            print(
                'Монстр вас покалечил,у вас отнялась 1 единица здоровья,всего у вас',
                Hp, 'здоровья')
    if situation == 7:
        print(
            '             ██████████████████████████████████████████████████')
        print(
            '             █─███─█───█───█────█─███─█────█─██─█────█───█────█')
        print(
            '             █──█──█─███─███─██─█──█──█─██─█─██─█─██─██─██─██─█')
        print(
            '             █─█─█─█───█─███────█─█─█─█─██─█────█─█████─██────█')
        print(
            '             █─███─█─███─███─██─█─███─█─██─█─██─█─██─██─██─████')
        print(
            '             █─███─█───█─███─██─█─███─█────█─██─█────██─██─████')
        print(
            '             ██████████████████████████████████████████████████')
        print('                           ▒▒▒▒▒▒▒▒▄▄▄▄▄▄▄▄▒▒▒▒▒▒')
        print('                           ▒▒█▒▒▒▄██████████▄▒▒▒▒')
        print('                           ▒█▐▒▒▒████████████▒▒▒▒')
        print('                           ▒▌▐▒▒██▄▀██████▀▄██▒▒▒')
        print('                           ▐┼▐▒▒██▄▄▄▄██▄▄▄▄██▒▒▒')
        print('                           ▐┼▐▒▒██████████████▒▒▒')
        print('                           ▐▄▐████─▀▐▐▀█─█─▌▐██▄▒')
        print('                           ▒▒█████──────────▐███▌')
        print('                           ▒▒█▀▀██▄█─▄───▐─▄███▀▒')
        print('                           ▒▒█▒▒███████▄██████▒▒▒')
        print('                           ▒▒▒▒▒██████████████▒▒▒')
        print('                           ▒▒▒▒▒█████████▐▌██▌▒▒▒')
        print('                           ▒▒▒▒▒▐▀▐▒▌▀█▀▒▐▒█▒▒▒▒▒')
        print('                           ▒▒▒▒▒▒▒▒▒▒▒▐▒▒▒▒▌▒▒▒▒▒')
        Atkm = r.randint(5, 15)
        if steps > 80: Atkm += r.randint(10, 20)
        print('На вас напал МегаМонстр!Силой', Atkm, 'твоя атака-', Atk)
        if Atk >= Atkm:
            Coins += 3
            print('Ты победил монстра,и ты получил 3 монеты')
            print('Всего у тебя', Coins, 'монет')
        if Atk < Atkm:
            Hp -= 1
            print(
                'Монстр вас покалечил,у вас отнялась 1 единица здоровья,всего у вас',
                Hp, 'здоровья')
    elif situation == 2:
        print('Вы нашли золото')
        print('1 Единицу')
        Coins += 1
        print('Всего у тебя', Coins, 'монет')
    elif situation == 3:
        print('Вы нашли бутылёчек с маной')
        print('1 Единицу')
        Mp += 1
        print('Всего у тебя', Mp, 'маны')
    elif situation == 4:
        print('Вы нашли бинт с зелёнкой')
        print('добавлено к Hp 1 Единица')
        Hp += 1
        print('Всего у тебя', Hp, 'здоровья')
    elif situation == 5:
        print('Вы нашли новое оружие')
        Atk += 1
        print('Всего у тебя', Atk, 'силы урона')
    elif situation == 0:

        print('-------------------')
        print('Ты встретил бродячего торговца')
        print('у тебя есть', Coins, 'монет')
        print('и можешь купить себе:')
        print('Нажми 1 если хочешь купить ауру к жизни +2Hp за 2 монет')
        print('Нажми 2 если хочешь купить амулет к мане +1Mp за 1 монету')
        print(
            'Нажми 3 если хочешь купить нунчаки к силе удара +5Atk за 3 монеты'
        )
        print('Нажми Enter если не хочешь ничего покупать и идти дальше')
        magaz = input('жми ')
        print('-------------------')
        if magaz == '1':
            if Coins < 2:
                print('торговец плюнул тебе в лицо, у тебя недостаточно монет')
        elif Coins > 1:
            if magaz == '1':
                Coins -= 2
                Hp += 2
        if magaz == '2':
            if Coins < 1:
                print('торговец плюнул тебе в лицо, у тебя недостаточно монет')
        elif Coins > 0:
            if magaz == '2':
                Coins -= 1
                Mp += 1
        if magaz == '3':
            if Coins < 3:
                print('торговец плюнул тебе в лицо, у тебя недостаточно монет')
        elif Coins > 2:
            if magaz == '3':
                Coins -= 3
                Atk += 5
            else:
                print('-------------------')
                print('Ты прошел мимо торговца')
        print('У тебя в инвентаре', 'Монет-', Coins, 'Силы-', Atk, 'Здоровья-',
              Hp, 'Маны-', Mp)
    elif situation == 6:
        loter_1 = r.randint(1, 10)
        print('-------------------')
        print('           ██████████████████████████████')
        print('           █─███─█─█─█───█─██─█─██─█─██─█')
        print('           █─███─█─█─██─██─██─█─██─█─█─██')
        print('           █─█─█─█───██─██────█─█──█──███')
        print('           █─█─█─███─██─██─██─█──█─█─█─██')
        print('           █─────█───██─██─██─█─██─█─██─█')
        print('           ██████████████████████████████')
        print('       ░░░░░░░░░░░░░░░░░░░▄░▄░░░░░░░░░░░░░░░')
        print('       ░░░░░░░░░░░░░░░▄█▄█████▄█░░░░░░░░░░░░')
        print('       ░░░░░░░░░░░░░░▄█████████▀░░░░░░░░░░░░')
        print('       ░░░░░░░░░░░░▄█▀▀▀▀▀▀▀▀▀█▄▄░░░░░░░░░░░')
        print('       ░░░░░░░░░▄█▀▀░░░░░░░░░░░░▀█▄░░░░░░░░░')
        print('       ░░░░░▄▄▄▄█░░░░░░░▄▄▄▄░░░░░░▀█▄▄▄░░░░░')
        print('       ░░░▄▄████░░░░░░░▄▄▄▄▄▄░░░░░░▀████▄░░░')
        print('       ░░▀█████░░░░░░░░░░░░░░░░░░░░░█████▀░░')
        print('       ░███████░░░░░░░░░░░░░░░░░░░░░░██████▄')
        print('       █████▀██░░░░▄█░░░░░░░░░▄█▄░░░░█▀█████')
        print('       █████░██░▄██▀▀██▄░░░▄██▀▀██▄░░█░█████')
        print('       ▀████░██░▀██████▀░░░░▀█████▀░░█░█████')
        print('       ░███████░░░░█▀░░░▄▄▄░░░░▀█░░░▄█▄████▀')
        print('       ░▀██████▄░░░░░░░█████▄░░░░░░░███████░')
        print('       ░░▀░█▀░▀█░░░░░░░██████░░░░░░██░▀█░░▀░')
        print('       ░░░░░░░░▀█░░▄▄░░░▀▀▀▀░░▄▄░░▄█░░░░░░░░')
        print('       ░░░░░░░░░▀█░▀█▄██▄░▄▄█▄█▀░▄█░░░░░░░░░')
        print('       ░░░░░░░░░░▀█▄░▀████████▀▄█▀░░░░░░░░░░')
        print('       ░░░░░░░░░░░░▀█▄░▀░▀░▀░▄█▀░░░░░░░░░░░░')
        print('       ░░░░░░░░░░░░░░▀▀▄▄▄▄▄▀▀░░░░░░░░░░░░░░')
        print('Ты встретил гнома-шутника который любит сыграть на удачу')
        print('у тебя есть', Coins, 'монет')
        print('и можешь попробовать за 10 монет')
        print('угадать число загаданное и получить 30 монет ')
        print('Нажми "Y" если хочешь угадать число ')
        print('Нажми любую клавишу если хочешь пройти мимо')
        otvet = input()
        if otvet == 'Y':

            if Coins < 10:
                print('гном над тобой посмеялся, у тебя недостаточно монет')
            elif Coins > 9:
                otvet = int(input('напиши число на удачу от 1 до 10  '))
                if otvet == loter_1:
                    print('-------------------')
                    print('СЧАСТЛИВЧИК, получи 50 монет')
                    Coins += 40
                elif otvet < loter_1:
                    print(
                        'гном над тобой посмеялся,тебе не повезло ты потратил 10 монет'
                    )
                    Coins -= 10
                elif otvet > loter_1:
                    print(
                        'гном над тобой посмеялся,тебе не повезло ты потратил 10 монет'
                    )
                    Coins -= 10
        else:
            print('-------------------')
            print('ты был хитрее и прошел мимо гнома')
        print('У тебя в инвентаре', 'Монет-', Coins)
    elif situation == 8:
        print('-------------------')
        print('Ты встретил заброшенный алтарь')
        print('у тебя есть', Mp, 'маны')
        print('и можешь попросить священника дать тебе :')
        print('Нажми 1 если хочешь взять телепорт +50 шагов за 20 маны')
        print('Нажми 2 если хочешь взять посох + 10Atk за 25 маны')
        print('Нажми 3 если хочешь взять камень жизни +15 Hp за 30 маны')
        print('Нажми Enter если не хочешь ничего покупать и идти дальше')
        altar = input('жми ')
        print('-------------------')
        if altar == '1':
            if Mp < 20:
                print(
                    'священник дал тебе своим посохом по лбу, за его потраченное время, у тебя недостаточно маны'
                )
        elif Mp > 19:
            if altar == '1':
                Mp -= 20
                steps += 50
        if altar == '2':
            if Mp < 25:
                print(
                    'священник дал тебе своим посохом по лбу, за его потраченное время, у тебя недостаточно монет'
                )
        elif Mp > 24:
            if altar == '2':
                Mp -= 25
                Atk += 10
        if altar == '3':
            if Mp < 30:
                print(
                    'священник дал тебе своим посохом по лбу, за его потраченное время, у тебя недостаточно монет'
                )
        elif Mp > 29:
            if altar == '3':
                Mp -= 30
                Hp += 15
            else:
                print('Ты прошел мимо алтаря')
        print('У тебя в инвентаре', 'Силы-', Atk, 'Здоровья-', Hp, 'Маны-', Mp)
    else:
        print('Бегу...')
    if steps == 100:
        print('                          █████████████████████')
        print('                          █────█────█────█────█')
        print('                          █─████─██─█─██─█─██─█')
        print('                          █────█─██─█─████─████')
        print('                          █─██─█─██─█─██─█─██─█')
        print('                          █────█────█────█────█')
        print('                          █████████████████████')
        print('                  ───────▄█──────────█─────────█▄───────')
        print('                  ─────▐██──────▄█──███──█▄─────██▌─────')
        print('                  ────▐██▀─────█████████████────▀██▌────')
        print('                  ───▐██▌─────██████████████─────▐██▌───')
        print('                  ───████────████████████████────████───')
        print('                  ──▐█████──██████████████████──█████▌──')
        print('                  ───████████████████████████████████───')
        print('                  ────███████▀▀████████████▀▀███████────')
        print('                  ─────█████▌──▄▄─▀████▀─▄▄──▐█████─────')
        print('                  ───▄▄██████▄─▀▀──████──▀▀─▄██████▄▄───')
        print('                  ──██████████████████████████████████──')
        print('                  ─████████████████████████████████████─')
        print('                  ▐██████──███████▀▄██▄▀███████──██████▌')
        print('                  ▐█████────██████████████████────█████▌')
        print('                  ▐█████─────██████▀──▀██████─────█████▌')
        print('                  ─█████▄─────███────────███─────▄█████─')
        print('                  ──██████─────█──────────█─────██████──')
        print('                  ────█████────────────────────█████────')
        print('                  ─────█████──────────────────█████─────')
        print('                  ──────█████────────────────█████──────')
        print('                  ───────████───▄────────▄───████───────')
        print('                  ────────████─██────────██─████────────')
        print('                  ────────████████─▄██▄─████████────────')
        print('                  ───────████████████████████████───────')
        print('                  ───────████████████████████████───────')
        print('                  ────────▀█████████▀▀█████████▀────────')
        print('                  ──────────▀███▀────────▀███▀──────────')
        Atkb = r.randint(30, 100)
        print('На вас напал первый босс монстр! Силой', Atkb, 'твоя атака-',
              Atk)
        if Atk >= Atkb:
            Coins += 1
            print(
                'Ты победил второй босса монстра,охранявшего последние врата,и ты получил 50 монет'
            )
            print('Всего у тебя', Coins, 'монет')
        elif Atk < Atkb:
            Hp -= 5
            print(
                'Монстр вас покалечил,у вас отнялось 5 единиц здоровья,всего у вас',
                Hp, 'здоровья')
    command = str(input('жми Enter'
                        '\n'))
    if command == 'save':
        funcs.save(Hp,Coins,Atk,Mp,steps)
    elif command == 'load':
        Hp,Coins,Atk,Mp,steps = funcs.load(Hp,Coins,Atk,Mp,steps)
    os.system(platform_clear)
if Hp <= 0:
    print('▒▒▒▒▒▒▒▒▒▒▒▄▄▄▄░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('▒▒▒▒▒▒▒▒▒▄██████▒▒▒▒▒▄▄▄█▄▒▒▒▒▒▒▒▒▒▒')
    print('▒▒▒▒▒▒▒▄██▀░░▀██▄▒▒▒▒████████▄▒▒▒▒▒▒')
    print('▒▒▒▒▒▒███░░░░░░██▒▒▒▒▒▒█▀▀▀▀▀██▄▄▒▒▒')
    print('▒▒▒▒▒▄██▌░░░░░░░██▒▒▒▒▐▌▒▒▒▒▒▒▒▒▀█▄▒')
    print('▒▒▒▒▒███░░▐█░█▌░██▒▒▒▒█▌▒▒▒▒▒▒▒▒▒▒▀▌')
    print('▒▒▒▒████░▐█▌░▐█▌██▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('▒▒▒▐████░▐░░░░░▌██▒▒▒█▌▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('▒▒▒▒████░░░▄█░░░██▒▒▐█▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('▒▒▒▒████░░░██░░██▌▒▒█▌▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('▒▒▒▒████▌░▐█░░███▒▒▒█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('▒▒▒▒▐████░░▌░███▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('▒▒▒▒▒████░░░███▒▒▒▒█▌▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('▒▒▒██████▌░████▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('▒▐████████████▒▒███▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('▒█████████████▄████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('██████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('██████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('█████████████████▀▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('█████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒')
    print('Ты погиб')

elif steps == 201:
    print('!!!!!!!!!!!!!!!!Ты победил!!!!!!!!!!!!!!!!!!')
    print('!!!!!ты дошел до до Зачарованного Города!!!!!!')
    print('!!!!!!!!!!!!!!!!Ты победил!!!!!!!!!!!!!!!!!!')
    print('-------------------')
    print('У тебя в инвентаре', 'Монет-', Coins, 'Силы-', Atk, 'Здоровья-', Hp,
          'Маны-', Mp)
